from src.db.router import conn, cursor


async def get_statistics_by_user(user_id, year_id):
    cursor.execute("""SELECT * FROM bot_app_statistics WHERE user_id=%s AND year=%s""", (user_id, year_id,))

    result = cursor.fetchall()

    message = ""
    if result is not None:
        for _ in result:
            if _[26] == '1':
                msg = (f"🤸‍♂️<b>Статистика за Январь</b>🤸‍♂️\n\n"
                       f"Гром - {_[3]}\n"
                       f"Турецкий подъем: Аксель - {_[4]}\n"
                       f"Турецкий подъем: Гиря - {_[5]}\n"
                       f"Жим лежа 1ПМ - {_[6]}\n"
                       f"Рывок акселя 1ПМ - {_[7]}\n"
                       f"Взятие на грудь акселя 1ПМ - {_[8]}\n"
                       f"Ягодичный мостик 1ПМ - {_[9]}\n"
                       f"Становая тяга 1ПМ - {_[10]}\n"
                       f"Рывок 1ПМ - {_[11]}\n"
                       f"Взятие на грудь 1ПМ - {_[12]}\n"
                       f"Становая тяга акселя 1ПМ - {_[13]}\n"
                       f"Присед 1ПМ: Классический - {_[14]}\n"
                       f"Присед 1ПМ: Фронтальный - {_[15]}\n"
                       f"Присед 1ПМ: Над головой - {_[16]}\n"
                       f"Скакалка - {_[17]}\n"
                       f"Отжимания от пола - {_[18]}\n"
                       f"Челночный бег - {_[19]}\n"
                       f"Прогулка фермера - {_[20]}\n"
                       f"Подтягивания - {_[21]}\n"
                       f"Прыжок в высоту - {_[22]}\n"
                       f"Прыжок в длину - {_[23]}\n"
                       f"Удержание акселя - {_[24]}\n"
                       f"Стойка на руках - {_[25]}\n")

                message += msg + "\n\n"

            elif _[26] == '4':
                msg = (f"🏅<b>Статистика за Апрель</b>🏅\n\n"
                       f"Гром - {_[3]}\n"
                       f"Турецкий подъем: Аксель - {_[4]}\n"
                       f"Турецкий подъем: Гиря - {_[5]}\n"
                       f"Жим лежа 1ПМ - {_[6]}\n"
                       f"Рывок акселя 1ПМ - {_[7]}\n"
                       f"Взятие на грудь акселя 1ПМ - {_[8]}\n"
                       f"Ягодичный мостик 1ПМ - {_[9]}\n"
                       f"Становая тяга 1ПМ - {_[10]}\n"
                       f"Рывок 1ПМ - {_[11]}\n"
                       f"Взятие на грудь 1ПМ - {_[12]}\n"
                       f"Становая тяга акселя 1ПМ - {_[13]}\n"
                       f"Присед 1ПМ: Классический - {_[14]}\n"
                       f"Присед 1ПМ: Фронтальный - {_[15]}\n"
                       f"Присед 1ПМ: Над головой - {_[16]}\n"
                       f"Скакалка - {_[17]}\n"
                       f"Отжимания от пола - {_[18]}\n"
                       f"Челночный бег - {_[19]}\n"
                       f"Прогулка фермера - {_[20]}\n"
                       f"Подтягивания - {_[21]}\n"
                       f"Прыжок в высоту - {_[22]}\n"
                       f"Прыжок в длину - {_[23]}\n"
                       f"Удержание акселя - {_[24]}\n"
                       f"Стойка на руках - {_[25]}\n")

                message += msg + "\n\n"

            elif _[26] == '7':
                msg = (f"🏋️‍♀️<b>Статистика за Июль</b>🏋️‍♀️\n\n"
                       f"Гром - {_[3]}\n"
                       f"Турецкий подъем: Аксель - {_[4]}\n"
                       f"Турецкий подъем: Гиря - {_[5]}\n"
                       f"Жим лежа 1ПМ - {_[6]}\n"
                       f"Рывок акселя 1ПМ - {_[7]}\n"
                       f"Взятие на грудь акселя 1ПМ - {_[8]}\n"
                       f"Ягодичный мостик 1ПМ - {_[9]}\n"
                       f"Становая тяга 1ПМ - {_[10]}\n"
                       f"Рывок 1ПМ - {_[11]}\n"
                       f"Взятие на грудь 1ПМ - {_[12]}\n"
                       f"Становая тяга акселя 1ПМ - {_[13]}\n"
                       f"Присед 1ПМ: Классический - {_[14]}\n"
                       f"Присед 1ПМ: Фронтальный - {_[15]}\n"
                       f"Присед 1ПМ: Над головой - {_[16]}\n"
                       f"Скакалка - {_[17]}\n"
                       f"Отжимания от пола - {_[18]}\n"
                       f"Челночный бег - {_[19]}\n"
                       f"Прогулка фермера - {_[20]}\n"
                       f"Подтягивания - {_[21]}\n"
                       f"Прыжок в высоту - {_[22]}\n"
                       f"Прыжок в длину - {_[23]}\n"
                       f"Удержание акселя - {_[24]}\n"
                       f"Стойка на руках - {_[25]}\n")

                message += msg + "\n\n"

            elif _[26] == '10':
                msg = (f"<b>🏆Статистика за Октябрь</b>🏆\n\n"
                       f"Гром - {_[3]}\n"
                       f"Турецкий подъем: Аксель - {_[4]}\n"
                       f"Турецкий подъем: Гиря - {_[5]}\n"
                       f"Жим лежа 1ПМ - {_[6]}\n"
                       f"Рывок акселя 1ПМ - {_[7]}\n"
                       f"Взятие на грудь акселя 1ПМ - {_[8]}\n"
                       f"Ягодичный мостик 1ПМ - {_[9]}\n"
                       f"Становая тяга 1ПМ - {_[10]}\n"
                       f"Рывок 1ПМ - {_[11]}\n"
                       f"Взятие на грудь 1ПМ - {_[12]}\n"
                       f"Становая тяга акселя 1ПМ - {_[13]}\n"
                       f"Присед 1ПМ: Классический - {_[14]}\n"
                       f"Присед 1ПМ: Фронтальный - {_[15]}\n"
                       f"Присед 1ПМ: Над головой - {_[16]}\n"
                       f"Скакалка - {_[17]}\n"
                       f"Отжимания от пола - {_[18]}\n"
                       f"Челночный бег - {_[19]}\n"
                       f"Прогулка фермера - {_[20]}\n"
                       f"Подтягивания - {_[21]}\n"
                       f"Прыжок в высоту - {_[22]}\n"
                       f"Прыжок в длину - {_[23]}\n"
                       f"Удержание акселя - {_[24]}\n"
                       f"Стойка на руках - {_[25]}\n")

                message += msg + "\n\n"

        return message

    else:
        "Cтатистика за выбранный год отсутствует"
